Autodesk.Revit.DB.Level.AssociatedPlanViewId
Retrieves the ElementId of the associated plan view to the Level.
The returned plan view of the Level depends on the discipline of the document.
Remarks:
This readonly property returns the ElementId of the associated plan view
to the Level, which depends on the discipline of the document.
If the Level has no view, the property value would be ElementId.InvalidElementId.

Autodesk.Revit.DB.Level
Represents a Level line within Autodesk Revit.
Remarks:
The Name property can be used to retrieve the user visible name of the level that appears in the level bubble.